#define _CRT_SECURE_NO_WARNINGS 1
//操作符：
//（1）算术操作符：+、-、*、/、%
//（2）移位操作符：>>、<<
//（3）赋值运算符：=、+=、-=、*=、/=、%=、&=、^=、|=、>>=、<<=
//（4）位操作符：&、|、^按位异或
//（5）单目运算符：只有一个操作数的操作符 //双目操作符：有两个操作数的操作符
		/*
		！逻辑反操作
		- 负值		//减号：双目操作符
		+ 正值		//加号：双目操作符
		& 取地址
		sizeof 操作数的类型长度（以字节为单位）
		~ 对就一个数的二进制按位取反
		-- 前置、后置--
		++ 前置、后置++
		* 间接访问操作符（解引用操作符）
		(类型) 强制类型转换
		*/
//（6）关系操作符：>、>=、<、<=、！=、==
//（7）逻辑操作符：&&、||
//（8）条件操作符/三目操作符：exp1？exp2：exp3//exp1成立，结果为exp2，否则结果为exp3
//（9）逗号表达式：exp1，exp2，exp3...expN
//（10）下标引用[]、函数调用()和结构成员：.和->

/*算术操作符：*/
//#include <stdio.h>
//int main()
//{
//	//算术操作符
//	"/"两端有一个是小数，结果为小数
//	int a = 9 / 2;	// /结果为商
//	float b = 9 / 2;
//	int c = 9.0 / 2;
//	float d = 9 / 2.0;
//	int e = 9 % 2;	// %结果为余数
//	printf("%d\n", a);//4
//	printf("%f\n", b);//4.000000
//	printf("%d\n", c);//4
//	printf("%f\n", d);//4.500000
//	printf("%d\n", e);//1
//	return 0;
//}

/*位移操作符*/
//#include <stdio.h>
//int main()
//{
//	//位移操作符：移动的是二进制位
//	int m = 2;
//	int f = m << 1;
//	//2是整型，占4个字节，二进制位32bit，即00000000 00000000 00000000 00000010
//	//进行左移操作，		 <-左移一位   00000000 00000000 00000000 00000010  -0000000 00000000 00000000 000000100=4
//	//左边丢弃，右边补0
//	//对操作数进行运算后，本身原来的操作数是不变的，如：变量m的值不变
// printf("%d\n", f);//4
//	return 0;
//}

/*位操作符*/
//#include <stdio.h>
//int main()
//{
//	//位操作符：二进制操作
//	//异或的计算规律：对应的二进制位相同，则为0。对应的二进制位相异，则位1。
//	int g = 3;//... ... ... 00000011
//	int h = 5;//... ... ... 00000101
//	int i = g ^ h;//... ... ... 00000110=6
//	printf("%d\n", i);//6
//	return 0;
//}

/*赋值运算符*/
//#include <stdio.h>
//int main()
//{
//	//赋值运算符
//	int j = 1;
//	j = j + 2;//给j加上2，再赋值给j
//	j += 2;//给j自己加上2，相当于j = j + 2;
//	printf("%d\n", j);//5
//	return 0;
//}

/*单目操作符*/
//#include <stdio.h>
//int main()
//{
//	//单目操作符
//	//逻辑结果:0表示假，非0表示真。假的结果为0，真的结果为1.
//	 int k = 10;
//	int k = -1;//负号为单目操作符
//	printf("%d\n", !k);//0
//	if (k)
//	{
//		//如果k为真，做事
//	}
//	if (!k)
//	{
//		//如果k为假，做事
//	}
//	//sizeof计算的是变量或者类型所占空间大小，单位为字节
//	printf("%d\n", sizeof(k));//4byte
//	printf("%d\n", sizeof(int));//4byte
//	printf("%d\n", sizeof k);//4byte，括号可以省略，说明sizeof是一个操作符，不是函数
//	//printf("%d\n", sizeof int);//报错，sizeof求变量可以省略，求类型不能省略

//	//sizeof计算数组的总大小
//	int arr[10] = { 0 };//10个整型元素的数组
//	printf("%d\n", sizeof(arr));//10 * sizeof(int) = 40单位：字节
//	printf("%d\n", arr[0]);//4

//	//计算数组元素的个数：数组总大小/每个元素的大小
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("%d\n", sz);

//	int n = 0;//默认有符号数，4个字节，32bit，即00000000 00000000 00000000 00000000--补码
//	printf("%d\n", ~n);//~n=-1，即11111111 11111111 11111111 11111111--补码，二进制符号按位取反，不考虑符号位
//	//整数在内存中存储的是补码，计算的是补码，使用的、打印显示的是原码
//	// 与传统意义上的010101、101010（没有特别说明都是正数）的计算含义不同，这里所说的是内存中存储的数据，符号位为0是正数，符号位为1是负数
//	//一个整数的二进制表示有三种：原码、反码、补码
//	//如：-1
//	//补码：11111111 11111111 11111111 11111111
//	//反码：11111111 11111111 11111111 11111110
//	//原码：10000000 00000000 00000000 00000001
//
//	int a = 10;
//	int b = a++;//后置++，先使用，再++（先赋值b，a再++）
//	printf("%d\n", b);//10
//  printf("%d\n", a);//11
//  a = 10;
//	int c = ++a;//前置++，先++，再使用（a先++，再赋值c）
//	printf("%d\n", c);//11
//  printf("%d\n", a);//11
//  //不管是前置++还是后置++，都会加一
//
//	int a = (int)3.14;//警告：“初始化”；从“double”转换到“int”，可能丢失数据
//	//3.14double类型转换成int a丢失精度
//	//解决方法：强制类型转换
//	printf("%d\n", a);
//	return 0;
//}

/*逻辑运算符*/
//#include <stdio.h>
//int main()
//{
//	//逻辑运算符
//	int x = 3;
//	int y = 5;
//	int z = x && y;
//	printf("%d\n", z);//1
//	return 0;
//}
// //&按位与和逻辑与&&

///*条件操作符（三目操作符）*/
//#include <stdio.h>
//int main()
//{
//	//条件操作符（三目操作符）
//	int x = 10;
//	int y = 33;
//	int max = 0;
//	if (x > y)
//	{
//		max = x;
//	}
//	else
//	{
//		max = y;
//	}
//	//max = x > y ? x : y;
//	printf("%d\n", max);
//	return 0;
//}

/*逗号表达式*/
//#include <stdio.h>
//int main()
//{
//	//逗号表达式
//	int x = 0;
//	int y = 3;
//	int z = 5;
//	int x = 0, y = 3, z = 5;
//	int w = (x = y + 2, z = x - 4, y = z + 2);
//	//w = 3,逗号表达式的特点：从左到右依次计算，整个结果为最后一个表达式的结果
//	//x = 3 + 2=5; z = 5 - 4=1; y = 1 + 2=3;
//	return 0;
//}

/*下标引用操作符*/
//#include <stdio.h>
//int main()
//{
//	//下标引用操作符
//	int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//	printf("%d\n", arr[5]);//6
//	return 0;
//}

/*函数调用操作符*/
//#include <stdio.h>
//int main()
//{
//	//函数调用操作符
//	printf("hehe\n");//调用函数的时候，函数名后边的()，如add()，就是函数调用操作符
//	printf("%d", 100);//函数调用操作符，可以传零个至多个操作数或者参数
//	return 0;
//}
